---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerItem.Dispose
source: html/f2e214b9-dd55-bcd9-877b-e24771ca3f4c.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.Dispose Method

Releases all resources used by the RebarContainerItem

## Syntax (C#)
```csharp
public void Dispose()
```